using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace RomajiKanaConverter
{
    internal class Table
    {
        public static readonly Dictionary<string, string> h2rTable = new Dictionary<string, string>
        {
            { "あ", "a" }, { "い", "i" }, { "う", "u" }, { "え", "e" }, { "お", "o" }, { "ん", "n" },
            {"ヴぁ", "va"}, {"ヴぃ", "vi"}, {"ヴ", "vu"}, {"ヴぇ", "ve"}, {"ヴぉ", "vo"},
            { "か", "ka" }, { "き", "ki" }, { "く", "ku" }, { "け", "ke" }, { "こ", "ko" },
            { "が", "ga" }, { "ぎ", "gi" }, { "ぐ", "gu" }, { "げ", "ge" }, { "ご", "go" },
            { "さ", "sa" }, { "すぃ", "si" }, { "す", "su" }, { "せ", "se" }, { "そ", "so" },
            { "ざ", "za" }, { "ずぃ", "zi" }, { "ず", "zu" }, { "ぜ", "ze" }, { "ぞ", "zo" },
            { "しゃ", "sha" }, { "し", "shi" }, { "しゅ", "shu" }, { "しぇ", "she" }, { "しょ", "sho" },
            { "じゃ", "ja" }, { "じ", "ji" }, { "じゅ", "ju" }, { "じぇ", "je" }, { "じょ", "jo" },
            { "た", "ta" }, { "てぃ", "ti" }, { "とぅ", "tu" }, { "て", "te" }, { "と", "to" },
            { "だ", "da" }, { "でぃ", "di" }, { "どぅ", "du" }, { "で", "de" }, { "ど", "do" },
            { "ちゃ", "cha" }, { "ち", "chi" }, { "ちゅ", "chu" }, { "ちぇ", "che" }, { "ちょ", "cho" },
            { "つぁ", "tsa" }, { "つぃ", "tsi" }, { "つ", "tsu" }, { "つぇ", "tse" }, { "つぉ", "tso" },
            { "づぁ", "dza" }, { "づぃ", "dzi" }, { "づ", "dzu" }, { "づぇ", "dze" }, { "づぉ", "dzo" },
            { "な", "na" }, { "に", "ni" }, { "ぬ", "nu" }, { "ね", "ne" }, { "の", "no" },
            { "は", "ha" }, { "ひ", "hi" }, { "ほぅ", "hu" }, { "へ", "he" }, { "ほ", "ho" },
            { "ば", "ba" }, { "び", "bi" }, { "ぶ", "bu" }, { "べ", "be" }, { "ぼ", "bo" },
            { "ぱ", "pa" }, { "ぴ", "pi" }, { "ぷ", "pu" }, { "ぺ", "pe" }, { "ぽ", "po" },
            { "ふぁ", "fa" }, { "ふぃ", "fi" }, { "ふ", "fu" }, { "ふぇ", "fe" }, { "ふぉ", "fo" },
            { "ま", "ma" }, { "み", "mi" }, { "む", "mu" }, { "め", "me" }, { "も", "mo" },
            { "や", "ya" }, { "いぃ", "yi" }, { "ゆ", "yu" }, { "いぇ", "ye" }, { "よ", "yo" },
            { "ら", "ra" }, { "り", "ri" }, { "る", "ru" }, { "れ", "re" }, { "ろ", "ro" },
            { "わ", "wa" }, { "うぃ", "wi" }, { "うぅ", "wu" }, { "うぇ", "we" }, { "うぉ", "wo" },
            {"ヴゃ", "vya"},{"ヴゅ", "vyu"}, {"ヴぃぇ", "vye"}, {"ヴょ", "vyo"},
            {"ふゃ", "fya"},{"ふゅ", "fyu"}, {"ふぃぇ", "fye"}, {"ふょ", "fyo"},
            {"きゃ","kya"},{"きゅ","kyu"},{"きぇ","kye"},{"きょ","kyo"},
            {"ぎゃ","gya"},{"ぎゅ","gyu"},{"ぎぇ","gye"},{"ぎょ","gyo"},
            {"くぁ","kwa"},{"くぅ","kwu"},{"くぇ","kwe"},{"くぉ","kwo"},
            {"ぐぁ","gwa"},{"ぐぅ","gwu"},{"ぐぇ","gwe"},{"ぐぉ","gwo"},
            {"てゃ", "tya"},{"てゅ", "tyu"}, {"てぇ", "tye"}, {"てょ", "tyo"},
            {"でゃ", "dya"},{"でゅ", "dyu"}, {"でぇ", "dye"}, {"でょ", "dyo"},
            {"にゃ", "nya"},{"にゅ", "nyu"}, {"にぇ", "nye"}, {"にょ", "nyo"},
            {"ひゃ", "hya"},{"ひゅ", "hyu"}, {"ひぇ", "hye"}, {"ひょ", "hyo"},
            {"びゃ", "bya"},{"びゅ", "byu"}, {"びぇ", "bye"}, {"びょ", "byo"},
            {"ぴゃ", "pya"},{"ぴゅ", "pyu"}, {"ぴぇ", "pye"}, {"ぴょ", "pyo"},
            {"みゃ", "mya"},{"みゅ", "myu"}, {"みぇ", "mye"}, {"みょ", "myo"},
            {"りゃ", "rya"},{"りゅ", "ryu"}, {"りぇ", "rye"}, {"りょ", "ryo"},
            { "ガ", "nga" }, { "ギ", "ngi" }, { "グ", "ngu" }, { "ゲ", "nge" }, { "ゴ", "ngo" },
            { "ラ", "la" }, { "リ", "li" }, { "ル", "lu" }, { "レ", "le" }, { "ロ", "lo" },
            { "リャ", "lya" }, { "リュ", "lyu" }, { "リェ", "lye" }, { "リョ", "lyo" },
        };

        public static Dictionary<string, string> r2hTable = Table.h2rTable.ToDictionary(entry => entry.Value, entry => entry.Key);
    }
}
